#1 Задание
print("\n")

b = int(input("Введите второе число: "))
a = int(input("Введите первое число: "))
c = int(input("Введите Третъе число: "))
if a > 0 and b > 0 and c > 0:
    print("Сумма трёх положительных чисел: ", a + b + c)
if a < 0 and b > 0 and c > 0:
    print("Сумма двух положительных чисел: ", b + c)
if a > 0 and b < 0 and c > 0:
    print("Сумма двух положительных чисел: ", a + c)
if a > 0 and b > 0 and c < 0:
    print("Сумма двух положительных чисел: ", b + a)

#2 Задание
print("\n")

